Repository: Plex-VDR-HDHomerun/vdr-plugin-iptv
Catalog: po/*.po
Languages: fi_fi

source: Experience the IPTV
fi_fi: Koe IPTV:n ihmeellinen maailma

source: Protocol
fi_fi: Protokolla

source: Delay (ms)
fi_fi: Viive (ms)

source: Script
fi_fi: Skripti

source: Parameter
fi_fi: Parametri

source: Address
fi_fi: Osoite

source: Port
fi_fi: Portti

source: Scan Sid
fi_fi: Etsi palvelu-ID

source: Scan pids
fi_fi: Etsi pidit

source: Nid
fi_fi: Verkko-ID

source: Tid
fi_fi: Lähete-ID

source: Rid
fi_fi: Radio-ID

source: Cannot find unique channel settings!
fi_fi: Yksilöllisiä kanava-asetuksia ei löydetä!

source: IPTV Channels
fi_fi: IPTV-kanavat

source: IPTV Information
fi_fi: IPTV-tiedot

source: General
fi_fi: Yleiset

source: Pids
fi_fi: Pidit

source: Filters
fi_fi: Suodattimet

source: Bits/bytes
fi_fi: Bitit/tavut

source: IPTV information not available!
fi_fi: IPTV-tietoja ei saatavilla!

source: TS buffer size [MB]
fi_fi: TS-puskurin koko [MB]

source: Define a ringbuffer size for transport streams in megabytes. Smaller sizes help memory consumption, but are more prone to buffer overflows.
fi_fi: Määritä rengaspuskurin koko TS-lähetteelle megatavuina. Pienempi rengaspuskuri vähentää muistinkulutusta, mutta on virhealttiimpi puskurin ylivuodolle.

source: TS buffer prefill ratio [%]
fi_fi: TS-puskurin esitäyttöaste [%]

source: Define a prefill ratio of the ringbuffer for transport streams before data is transferred to VDR. This is useful if streaming media over a slow or unreliable connection.
fi_fi: Määrittele TS-rengaspuskurin esitäyttöaste, jonka jälkeen lähetettä aletaan siirtämään eteenpäin VDR:lle. Puskurin esitäyttö parantaa suoratoistoa hitailla ja epäluotettavilla yhteyksillä.

source: EXT protocol base port
fi_fi: EXT-protokollan perusportti

source: Define a base port used by EXT protocol. The port range is defined by the number of IPTV devices. This setting sets the port which is listened for connections from external applications when using the EXT protocol.
fi_fi: Määrittele EXT-protokollan käyttämä perusportti. Porttiavaruuden koko määräytyy käytettyjen IPTV-laitteiden mukaan. Laajennos lukee EXT-protokollan yhteydessä perusportista dataa, jota ulkoiset ohjelmistot tarjoavat.

source: Use section filtering
fi_fi: Käytä sektioiden suodatusta

source: Define whether the section filtering shall be used. Section filtering means that IPTV plugin tries to parse and provide VDR with secondary data about the currently active stream. VDR can then use this data for providing various functionalities such as automatic pid change detection and EPG etc. Enabling this feature does not affect streams that do not contain section data.
fi_fi: Määrittele suodatuksen käyttö sektioille. IPTV-laajennos voi suodattaa lähetteestä VDR:lle tarjottavia sektioita, joita käytetään esim. ohjelmaoppaan ja ohjelmatunnisteiden (PID) päivittämiseen. Toiminto ei vaikuta lähetteeseen, jossa ei ole sektioita.

source: Disable filters
fi_fi: Poista suodattimia käytöstä

source: Define number of section filters to be disabled. Certain section filters might cause some unwanted behaviour to VDR such as time being falsely synchronized. By black-listing the filters here useful section data can be left intact for VDR to process.
fi_fi: Määrittele käytöstä poistettavien suodattimien lukumäärä sektioille. Tietyt sektiot saattavat aiheuttaa virheellistä toimintaa VDR:ssä, esimerkiksi asettavat väärän kellonajan, ja näiden poistaminen auttaa VDR:ää toimimaan kunnolla jäljelle jäävien sektioiden kanssa.

source: Disable filter
fi_fi: Poista suodatin käytöstä

source: Define an ill-behaving filter to be blacklisted.
fi_fi: Määrittele käytöstä poistettava suodatin, joka lisätään mustalle listalle.

source: Help
fi_fi: Opaste
